app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    disable_comment_if_private(@post)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "body", "opinion_needed", "is_anonymous", "created_at", "updated_at", "post_type", "title", "is_public", "comment_allowed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    updated_params = prepare_updated_params(@post, post_params)

    if @post.update(updated_params)
---
UPDATE "posts" SET "opinion_needed" = $1, "updated_at" = $2, "post_type" = $3 WHERE "posts"."id" = $4  [["opinion_needed", nil], ["updated_at", "2025-10-27 16:03:53.016554"], ["post_type", 2], ["id", 51]]

  def destroy
    @post.destroy
    redirect_after_action(nil, t('posts.notices.deleted'))
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 149]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 17]]

  def set_post
    @post = Post.includes(:user, comments: :user, flowers: :user).find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 149], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]