app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "body", "opinion_needed", "is_anonymous", "created_at", "updated_at", "post_type", "title", "is_public", "comment_allowed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params_for_create)
    disable_comment_if_private(@post)

    if request.format.json?
      if @post.save
        render json: {
          success: true,
          data: {
            id: @post.id,
            post_type: @post.post_type,
            mood: @post.mood
          }
        }, status: :ok
      else
        render json: {
          success: false,
          errors: @post.errors.full_messages
        }, status: :unprocessable_entity
      end
    elsif @post.save
      redirect_to post_path(@post), notice: t('posts.notices.created')

UPDATE "posts" SET "updated_at" = $1, "is_public" = $2 WHERE "posts"."id" = $3  [["updated_at", "2025-10-27 15:43:10.587833"], ["is_public", nil], ["id", 51]]
---
  def update
    updated_params = prepare_updated_params(@post, post_params_for_update)

    if @post.update(updated_params)
      @post.reload
      redirect_after_action(@post, t('posts.notices.updated'))

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 45]]
---
  def destroy
    @post.destroy
    redirect_after_action(nil, t('posts.notices.deleted'))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_post
    @post = Post.includes(:user, comments: :user, flowers: :user).find(params[:id])