app/controllers/posts_controller.rb

  def update
    updated_params = prepare_updated_params(@post, post_params_for_update)

    if @post.update(updated_params)
      @post.reload
      redirect_after_action(@post, t('posts.notices.updated'))
---
UPDATE "posts" SET "opinion_needed" = $1, "updated_at" = $2, "post_type" = $3 WHERE "posts"."id" = $4  [["opinion_needed", nil], ["updated_at", "2025-10-27 16:03:53.016554"], ["post_type", 2], ["id", 51]]

  def destroy
    @post.destroy
    redirect_after_action(nil, t('posts.notices.deleted'))
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 51]]